Repository: Siddharth-Technovert/aad_oauth_custom
Catalog: lib/core/utils/l10n/app_*.arb
Languages: hi

source: Api Error
hi: Api त्रुटि

# badRequest
source: Error:400 Bad request
hi: त्रुटि:400 खराब अनुरोध

source: Cache error:
hi: कैश त्रुटि:

source: Cancel
hi: रद्द करना

# connectTimeout
source: Connection to server timed out
hi: सर्वर से संपर्क का समय समाप्त

source: Connectivity Status
hi: कनेक्टिविटी स्थिति

# connectivityStatusWait
source: Connectivity Status: Plz wait for connection
hi: कनेक्टिविटी स्थिति: कृपया कनेक्शन के लिए प्रतीक्षा करें

# crashAppFirebase
source: Crash the App! (Firebase Test)
hi: ऐप को क्रैश करें! (फायरबेस टेस्ट)

source: Dashboard Screen
hi: डैशबोर्ड स्क्रीन

# defaultError
source: Api Error occurred:
hi: एपीआई त्रुटि हुई:

# deleteCacheError
source: Failed to delete data to cache
hi: कैशे में डेटा हटाने में विफल

# errorMsg
source: Error
hi: त्रुटि

# fetchCacheError
source: Failed to fetch data from cache
hi: कैशे से डेटा लाने में विफल

source: Guest
hi: मेहमान

source: Guest Login
hi: मेहमान लॉगइन करें

# helloMsg
source: Hello {name}
hi: नमस्ते {name}

# infoToastText
source: This is the info
hi: यह जानकारी है

# insertCacheError
source: Failed to add data to cache
hi: कैश में डेटा सम्मिलित करने में विफल

# internalServerError
source: Error:500 Internal server error
hi: त्रुटि 500 ​​- आंतरिक सर्वर त्रुटि

# language
source: English
hi: हिन्दी

source: Login
hi: लॉग इन करें

source: Logout
hi: लॉग आउट

# logoutConfirm
source: Are you sure you want to logout from Massy Stores app?
hi: क्या आप वाकई जेननेक्स ऐप से लॉगआउट करना चाहते हैं?

# networkError
source: Unable to connect to internet
hi: इंटरनेट से कनेक्ट करने में असमर्थ

source: OK
hi: ठीक है

# policyAcknowledge
source: and acknowledging that you've read our
hi: और यह स्वीकार करते हुए कि आपने हमारा पढ़ा है

# policyAgree
source: By Continuing, You are agreeing to our
hi: जारी रखते हुए, आप हमारी सहमति से सहमत हैं

# policyTerm
source: Terms of Use
hi: उपयोग की शर्तें

source: Privacy Policy
hi: गोपनीयता नीति

# receiveTimeout
source: Receive timeout in connection with server
hi: सर्वर के संबंध में टाइमआउट प्राप्त करें

# requestCancelled
source: Request to server was cancelled
hi: सर्वर से अनुरोध रद्द कर दिया गया था

# requestNotFound
source: Error:404 Request not found
hi: त्रुटि: 404 अनुरोध नहीं मिला

# sendTimeout
source: Send timeout in connection with server
hi: सर्वर के संबंध में टाइमआउट भेजें

# serializationError
source: Unable to deserialize data
hi: डेटा deserialize करने में असमर्थ

# successMsg
source: Success
hi: सफलता

source: Switch Theme
hi: थीम स्विच करें

# toastSample
source: Sample Toast
hi: नमूना टोस्ट

# toastShow
source: Show Toast
hi: टोस्ट दिखाओ

# unAuthorizedRequest
source: Error:401 Invalid api key
hi: त्रुटि: 401 अमान्य एपीआई कुंजी

# unexpectedError
source: Error: Something went wrong
hi: त्रुटि: कुछ गलत हो गया

source: Unknown Error
hi: अज्ञात त्रुटि

# updateCacheError
source: Failed to update data to cache
hi: कैश में डेटा अपडेट करने में विफल
